Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: The assignment to C<$^R> above is properly localized, so the old value of C<$^R> is restored if the assertion is backtracked; compare L<"Backtracking">.
es: La asignación a C<$^R> anterior está correctamente localizada, por lo que se restaura el valor anterior de C<$^R> si se vuelve atrás en la aserción; vea L<"Vuelta atrás">.

source: The attributes for a file object might include its path, content, and last modification time.
es: Los atributos de un objeto que representa un archivo podrían incluir su ruta, el contenido y la hora de la última modificación.

source: The belief that "small is beautiful." Paradoxically, if you say something in a small language, it turns out big, and if you say it in a big language, it turns out small.
es: La creencia de que "lo pequeño es bello". Paradójicamente, si se dice algo en un lenguaje pequeño, acaba por ser grande; y si se dice en un lenguaje grande, acaba por ser pequeño.

source: The best thing that can be said about virtual memory is that it lets your performance degrade gradually rather than suddenly when you run out of real memory.
es: Lo mejor que se puede decir de la memoria virtual es que, cuando se agota la memoria real, hace que el rendimiento se degrade de forma gradual, no súbitamente.

source: The binary operators C<+> C<-> C<*> C</> C<%> C<==> C<!=> C<E<gt>> C<E<lt>> C<E<gt>=> C<E<lt>=> and the unary operators C<-> C<abs> and C<--> will attempt to convert arguments to integers.
es: Los operadores binarios C<+> C<-> C<*> C</> C<%> C<==> C<!=> C<E<gt>> C<E<lt>> C<E<gt>=> y C<E<lt>=>, y los operadores unarios C<abs> y C<-->, intentan convertir los argumentos en enteros.

source: The bond between a magical variable and its implementation class.
es: Unión de una variable mágica a su clase de implementación.

source: The bracketing construct C<( ... )> creates capture groups (also referred to as capture buffers).
es: Los paréntesis C<( ... )> crean grupos de captura (también denominados búferes de captura).

source: The branches that begin with "origin" correspond to the "git remote" that you cloned from (which is named "origin").
es: Las ramas que empiezan por "origin" corresponden al repositorio "git remoto" del que ha generado un clon (se llama "origin").

source: The build system that Perl uses is called metaconfig. This system is maintained separately from the Perl core.
es: Perl usa un sistema de compilación denominado metaconfig. El mantenimiento de este sistema se realiza por separado del mantenimiento del núcleo de Perl.

source: The caching of conversions (as described above) means that the integer conversion does not throw away fractional parts on floating point numbers.
es: El almacenamiento en caché de las conversiones descritas arriba significa que la conversión a enteros no desecha las partes fraccionarias en los números de punto flotante.

source: The caller is responsible for incrementing the reference count of the array returned if it wants to keep the structure.
es: El código que llama debe encargarse de incrementar el contador de referencias del array devuelto si se quiere mantener la estructura.

source: The caret allows for simpler stringification of compiled regular expressions.
es: El signo de intercalación permite una conversión más sencilla de las expresiones regulares compiladas a cadena de caracteres.

source: The caret tells Perl that this cluster doesn't inherit the flags of any surrounding pattern, but uses the system defaults (C<d-imsx>), modified by any flags specified.
es: El signo de intercalación indica a Perl que esta agrupación no hereda las marcas de ningún patrón vecino, sino que usa los valores predeterminados del sistema (C<d-imsx>), modificados por las marcas especificadas.

source: The character C<NULL> is almost certainly at the zeroth position in all character sets, so its code point is 0.
es: El carácter C<NULL> está casi con toda seguridad en la posición cero de todos los juegos de caracteres, por lo que su código de carácter es 0.

source: The character after the question mark indicates the extension.
es: El carácter que va detrás del signo de interrogación indica la extensión.

source: The child can explicitly B<override> a parent's method to provide its own implementation.
es: La clase derivada puede B<sobrescribir> un método de la clase primaria para ofrecer su propia implementación.

source: The choice is yours, but you do want to get a module out for that server protocol.
es: La elección es suya, pero lo que está claro es que debe publicar un módulo para ese protocolo de servidor.

source: The class must at least provide a C<parse_from_file> method.
es: La clase debe proporcionar al menos un método C<parse_from_file>.

source: The closest to an address operator in Perl is the backslash operator, but it gives you a L</hard reference>, which is much safer than a memory address.
es: Lo más cercano a un operador de direccionamiento en Perl es el operador de barra diagonal inversa. Este operador devuelve una L</referencia estricta>, que es mucho más segura que una dirección de memoria.

source: The code above uses DB_File, but again it will work with any of the DBM modules.
es: El código anterior usa DB_File, pero funcionará con cualquiera de los módulos DBM.

source: The code above uses SDBM_File, but it will work with any of the DBM modules.
es: El código anterior usa SDBM_File, pero funcionará igual con todos los módulos DBM.

source: The code point for the C<SPACE> character in the ASCII character set is 0x20, or 32 decimal; in EBCDIC it is 0x40, or 64 decimal.
es: El código de carácter para el carácter C<ESPACIO> en el juego de caracteres ASCII es 0x20, o 32 decimal; en EBCDIC es 0x40, o 64 decimal.

source: The collective set of L<environment variables|/environment variable> your L</process> inherits from its parent.
es: El conjunto colectivo de L<variables de entorno|/variable de entorno> que el L</proceso> hereda del proceso principal.

source: The combination of multiple command-line switches (e.g., B<-a -b -c>) into one switch (e.g., B<-abc>).
es: Combinación de varios modificadores de línea de comandos (p. ej., B<-a -b -c>) en un solo modificador (p. ej., B<-abc>).

source: The command C<git clean> can with varying arguments be used as a replacement for C<make clean>.
es: Puede usar el comando C<git clean> con diversos argumentos como sustituto de C<make clean>.

source: The commit is then actually performed when you run the next command, which will bring up your editor to describe the commit.
es: La confirmación se realiza realmente cuando se ejecuta el siguiente comando, que abre el editor para que especifique una descripción de la confirmación.

source: The committers have SSH access to the two servers that serve C<perl5.git.perl.org>.
es: Las personas que contribuyen cambios tienen acceso SSH a los dos servidores que ofrecen servicio a C<perl5.git.perl.org>.

source: The complete Perl documentation is available with the Perl distribution.
es: La distribución de Perl incluye la documentación completa de Perl.

source: The complete regular expression matches this time, and you get the expected output of "table follows foo."
es: Ahora la expresión regular completa coincide, y se obtiene el resultado esperado de "espinacas sigue a come".

source: The computer on which a program or other data resides.
es: El equipo en el que reside un programa (u otros datos).

source: The conditions can be any Perl expression.
es: Una condición puede ser cualquier expresión Perl.

source: The constructor can also accept additional parameters that define the object.
es: El constructor también puede aceptar parámetros adicionales que definen el objeto.

source: The context given by the surrounding code determines what kind of data a particular L</expression> is expected to return.
es: El contexto proporcionado por el código del entorno determina el tipo de datos que se espera que una L</expresión> concreta devuelva.

source: The core always sets I<level> to 0 when it calls your function - the parameter is provided to allow your implementation to track depth if it needs to recurse.
es: El núcleo siempre establece I<level> en 0 cuando se llama a la función; el parámetro se proporciona para permitir que su implementación pueda realizar un seguimiento de la profundidad en caso de que tenga que funcionar de manera recursiva.

source: The core provides a wrapper program, F<Porting/bisect.pl>, which attempts to simplify as much as possible, making bisecting as simple as running a Perl one-liner.
es: El núcleo proporciona un programa encapsulador, F<Porting/bisect.pl>, que simplifica al máximo la bisección, convirtiéndola en algo tan sencillo como ejecutar un script de una línea.

source: The corpse of a L</process>, in the form of a file left in the L</working directory> of the process, usually as a result of certain kinds of fatal error.
es: Cadáver de un L</proceso>, en forma de archivo que queda en el L</directorio de trabajo> del proceso, generalmente como consecuencia de un determinado tipo de error irrecuperable.

source: The correct answer is either one of these:
es: La respuesta correcta es una de estas:

source: The current Perl 5 to-do list is maintained in the git repository, and can be viewed at L<http://perl5.git.perl.org/perl.git/blob/HEAD:/Porting/todo.pod>
es: Puede ver la lista actual de tareas pendientes de Perl 5 en el repositorio git: L<http://perl5.git.perl.org/perl.git/blob/HEAD:/Porting/todo.pod>

source: The current leading implementation of Perl 6 is Rakudo ( http://rakudo.org ).
es: Actualmente la implementación más avanzada de Perl 6 es Rakudo ( http://rakudo.org ).

source: The current major release of Perl is Perl 5, and was first released in 1994.
es: La versión principal actual de Perl es Perl 5, y se lanzó en 1994.

source: The customary Unix meaning of C is kludged in for C<s///>.
es: El significado habitual de C en Unix se emula de mala manera en C<s///>.

source: The data can be aggregated into obvious structures, especially if there's a large amount of data in each aggregate.
es: Los datos se pueden agregar en estructuras obvias, especialmente si hay una gran cantidad de datos en cada agregado.

source: The days of just flinging strings around are over.
es: Actualmente ya no es posible trabajar con cadenas de texto de manera irreflexiva.

source: The deeper underlying truth is that juxtaposition in regular expressions always means AND, except when you write an explicit OR using the vertical bar.
es: La verdad más profunda que subyace es que la yuxtaposición de las expresiones regulares siempre significa Y, salvo cuando se usa una conjunción O explícita mediante la barra vertical.

source: The default usage implies source code is included.
es: Su uso predeterminado implica la inclusión del código fuente.

source: The default argument to the C<shift> function just happens to be C<@_>.
es: El argumento predeterminado de la función C<shift> es C<@_>.

source: The default input L</stream> for your program, which if possible shouldn't care where its data is coming from.
es: L<Secuencia|/secuencia> de entrada predeterminada del programa, que no debe preocuparse del origen de los datos, si es posible.

source: The default output L</stream> for nasty remarks that don't belong in L</standard output>.
es: La L</secuencia> de salida estándar para comentarios desagradables que no corresponden a la L</salida estándar>.

source: The default output L</stream> for your program, which if possible shouldn't care where its data is going.
es: L<Secuencia|/secuencia> de salida predeterminada del programa, que no debe preocuparse del destino de los datos, si es posible.

source: The default subscript separator is "\034", the same as SUBSEP in B<awk>.
es: El separador de subíndice predeterminado es "\034", el mismo que SUBSEP en B<awk>.

source: The defaults are there for lazy systems programmers writing one-shot programs.
es: Los valores predeterminados son para los programadores de sistemas perezosos que escriben programas pequeños.

source: The deletion of a hash key from C<%^H> is recorded, and as ever can be distinguished from the existence of a key with value C<undef> with C<exists>.
es: La eliminación de una clave de hash de C<%^H> se registra y se puede distinguir de la existencia de una clave con valor C<undef> mediante C<exists>, de la manera habitual.

source: The difference between a package which is a class and one which isn't is based on how the package is used.
es: La diferencia entre un paquete que es una clase y uno que no lo es radica únicamente en cómo se utiliza.

source: The digits for 10 through 16 are customarily represented by the letters C<a> through C<f>.
es: Los dígitos 10 a 16 se suelen representar mediante las letras entre C<a> y C<f>.

source: The directory you are put into when you log in.
es: El directorio en el que se encuentra cuando inicia sesión.

source: The elements of the list are joined with the subscript separator (see L<perlvar/$;>).
es: Los elementos de la lista se unen con el separador de subíndice (vea "$;" en L<perlvar>).

source: The elements we're getting from the array start with a C<$> because we're getting just a single value out of the array; you ask for a scalar, you get a scalar.
es: Los nombres de los elementos que obtenemos del array empiezan por C<$> porque reciben valores individuales del array; si se pide un escalar, se obtiene un escalar.

source: The email you got when you received your CPAN ID will tell you how to log in to PAUSE, the Perl Authors Upload SErver.
es: En el mensaje de correo electrónico que recibió con el identificador de CPAN se incluyen instrucciones sobre cómo iniciar sesión en PAUSE (Perl Authors Upload Server, el servidor de carga para autores de módulos Perl).

source: The entire hardware and software context in which a program runs.
es: El contexto de hardware y software en el que se ejecuta un programa.

source: The error number returned by a L</syscall> when it fails.
es: El número de error devuelto por una L</llamada de sistema> si no tiene éxito.

source: The exception handling mechanism in Perl is the L<eval|perlfunc/eval> operator.
es: En Perl, el mecanismo de control de excepciones es el operador L<eval|perlfunc/eval>.

source: The exceptions, C<abs>, C<++> and C<-->, do not change their behavior with C<use integer;>
es: Las excepciones son C<abs>, C<++> y C<-->, que no cambian su comportamiento con C<use integer;>

source: The experimental C<legacy> pragma was swallowed by the C<feature> pragma.
es: El pragma C<legacy> experimental fue absorbido por el pragma C<feature>.

source: The experimental versions may include features that don't make it into the stable versions, and have an odd number as the minor release (i.e. perl5.9.x, where 9 is the minor release).
es: Las versiones experimentales pueden incluir características que no se incluyen en las versiones estables; en este caso el número de versión secundaria es un número impar (p. ej., perl5.9.x, donde 9 es la versión secundaria).

source: The expression \cI<x> matches the character control-I<x>.
es: La expresión \cI<x> detecta el carácter de control I<x>.

source: The fact that you can store such "large" numbers does not mean that the I<operations> over these numbers will use all of the significant digits.
es: El hecho de poder almacenar números tan "grandes" no significa que en las I<operaciones> con estos números se usen todos los dígitos significativos.

source: The features you got from your mother and father, mixed together unpredictably.
es: Las características que heredamos de nuestra madre y nuestro padre, combinadas de forma impredecible.

source: The features you got from your mother, if she told you that you don't have a father.
es: Las características que heredó de su madre, si esta le dijo que no tiene padre.

source: The filehandle is left open pointing to the line after __DATA__.
es: El identificador de archivo se deja abierto apuntando a la línea que hay a continuación de __DATA__.

source: The final element of a list assignment may be an array or a hash:
es: El último elemento de una asignación de lista puede ser un array o un hash:

source: The first character of the name tells you to what sort of data structure it refers.
es: El primer carácter del nombre nos indica el tipo de la estructura de datos.

source: The first version of this document appeared on Perl Monks, where several people had useful suggestions.
es: La primera versión de este documento se publicó en Perl Monks, donde muchas personas realizaron útiles sugerencias.

source: The flag is useless for this purpose, because it's off when an 8 bit encoding (by default ISO-8859-1) is used to store the string.
es: La marca no debe utilizarse para este fin, ya que se desactiva cuando se usa una codificación de 8 bits (de manera predeterminada, ISO-8859-1) para almacenar la cadena.

source: The following are equivalent:
es: Las instrucciones siguientes son equivalentes:

source: The following code segment prints out "The price is $Z<>100." X<interpolation>
es: El segmento de código siguiente imprime en pantalla "El precio es $100". X<interpolation> X<interpolación>

source: The following equivalences apply:
es: Se aplican las siguientes equivalencias:

source: The following example counts all the possible matching strings in a pattern (without actually matching any of them).
es: El siguiente ejemplo cuenta todas las posibles cadenas coincidentes de un patrón (sin que se produzca una coincidencia con ninguna de ellas, por efecto de C<(*FAIL)>).

source: The following example shows a 2 level hash of hash structure using anonymous hash references.
es: En el ejemplo siguiente se muestra una estructura de hash de hashes de 2 niveles en la que se usan referencias de hash anónimas.

source: The following is always true: X<array, length>
es: La siguiente expresión siempre es verdadera: X<array, length> X<array, longitud>

source: The following pattern matches a function foo() which may contain balanced parentheses as the argument.
es: El siguiente patrón detecta una función foo() que puede contener paréntesis emparejados como argumento.

source: The following pattern matches a parenthesized group:
es: El siguiente patrón detecta un grupo entre paréntesis:

source: The following shows how using negative indexing can make it easier to embed recursive patterns inside of a C<qr//> construct for later use:
es: A continuación se muestra cómo el uso de la indexación negativa puede facilitar la incrustación de patrones recursivos dentro de una construcción C<qr//> para su uso posterior:

source: The following standard quantifiers are recognized: X<metacharacter> X<quantifier> X<*> X<+> X<?> X<{n}> X<{n,}> X<{n,m}>
es: Se reconocen los siguientes cuantificadores estándar: X<metacharacter> X<quantifier> X<*> X<+> X<?> X<{n}> X<{n,}> X<{n,m}> X<metacarácter> X<cuantificador>

source: The formal arguments to a Perl program are C<$ARGV[0]>, C<$ARGV[1]>, and so on.
es: Los argumentos formales de un programa Perl son C<$ARGV[0]>, C<$ARGV[1]>, etc.

source: The former is a simple compression tool; the latter permits creation of multi-file archives.
es: La primera es una simple herramienta de compresión; la segunda permite crear archivos de almacenamiento de varios archivos.

source: The forms C<(?'NAME'pattern)> and C<< (?<NAME>pattern) >> are equivalent.
es: Las formas C<(?'NOMBRE'patrón)> y C<< (?<NOMBRE>patrón) >> son equivalentes.

source: The four C<filter_*> methods shown above are available in all the DBM modules that ship with Perl, namely DB_File, GDBM_File, NDBM_File, ODBM_File and SDBM_File.
es: Los cuatro métodos C<filter_*> mostrados arriba están disponibles en todos los módulos DBM incluidos en Perl: DB_File, GDBM_File, NDBM_File, ODBM_File y SDBM_File.

source: The full chemical name is "Berkeley Standard Distribution".
es: El nombre químico completo es "Berkeley Standard Distribution".

source: The full explanation is in L<Encode>.
es: Encontrará información detallada en L<Encode>.

source: The fully qualified method name that was called is available in the C<$AUTOLOAD> package global for your class.
es: El nombre completo del método llamado está disponible para su clase en la variable global de paquete C<AUTOLOAD>.

source: The function should return a reference to an array containing the parent classes in order.
es: La función debe devolver una referencia a un array con las clases primarias ordenadas.

source: The generic names by which a L</subroutine> knows its L<arguments|/argument>.
es: Nombres genéricos con los que se designa a los L<argumentos|/argumento> de una L</subrutina>.

source: The glob notation ** means recursively, (.)
es: La notación de glob ** significa recursivamente, (.)

source: The hex() and oct() functions make these conversions for you.
es: Las funciones hex() y oct() hacen estas conversiones.

source: The higher-level loops preserve an additional state between iterations: whether the last match was zero-length.
es: Los bucles de alto nivel preservan un estado adicional entre las iteraciones: si la última coincidencia fue de longitud cero.

source: The holder of the pumpkin is sometimes called the pumpking (keeping the source afloat?)
es: A la persona que tiene la calabaza en su poder a veces la llamamos I<pumpking> (¿quizás porque una bomba permite mantener el código a flote?)

source: The immediate, previous releases (i.e. perl5.8.x ) are usually maintained for a while, although not at the same level as the current releases.
es: Las versiones anteriores más recientes (en este caso, perl5.14.x) suelen mantenerse durante un tiempo, aunque en menor medida que las versiones actuales.

source: The implementation of individual components of the system is likely to change over time.
es: Es probable que la implementación de componentes individuales del sistema cambie con el tiempo.

source: The implementation of the C3 MRO and switchable MROs within the perl core was written by Brandon L Black.
es: La aplicación del orden de resolución de métodos C3 y los órdenes de resolución de métodos intercambiables del núcleo de Perl son obra de Brandon L. Black.

source: The implementation provides a cache, in which you can store a single C<SV *>, or anything that can be cast to C<SV *>, such as C<AV *>.
es: La implementación proporciona una caché en la que puede almacenar un único C<SV *>, o cualquier cosa que se pueda convertir en C<SV *>, como un C<AV *>.

source: The important difference between them is that test 3 contains a quantifier (C<\D*>) and so can use backtracking, whereas test 1 will not.
es: La diferencia importante es que, a diferencia de la prueba 1, la prueba 3 contiene un cuantificador (C<\D*>), por lo que puede usar la vuelta atrás.

source: The innermost always has priority over any outer ones, and one applying to the whole expression has priority over any of the default settings that are described in the remainder of this section.
es: La parte más interior siempre tiene prioridad sobre cualquier otra externa, y la que se aplica a toda la expresión tiene prioridad sobre cualquiera de los valores por defecto que se describen en el resto de esta sección.

source: The insertion of a scalar or list value somewhere in the middle of another value, such that it appears to have been there all along.
es: Inserción de un escalar o un valor de lista dentro de otro valor, de forma que parezca que siempre ha estado allí.

source: The instructions below assume that you copied it as F<~/run> and then edited it as appropriate.
es: En las instrucciones siguientes se supone que lo ha copiado como F<~/run> y ha hecho las modificaciones necesarias.
